# running in SimTop/src/
read_verilog -sv Core.v
read -sv define.sv
read_verilog -sv SimTop.sv
read_verilog -sv DifftestArchEvent.v
read_verilog -sv DifftestTrapEvent.v
read_verilog -sv DifftestCSRState.v
read_verilog -sv DifftestArchIntRegState.v
read_verilog -sv DifftestInstrCommit.v
read_verilog -sv MemRWHelper.v

prep -top Core

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
